**Name:** Mahendra Pratap Singh | **Reg ID:**  GO_STP_7372 | **Intern at:** Goeduhub Technologies | **Assignment:**5 | **Data Cleanig Using Pandas**

### Modules Installation

In [ ]:
pip install pandas
pip install numpy

### Importing Libraries

In [2]:
from pandas import *
from numpy import *

#### 1.  Load the IMDb Dataset and read

In [135]:
data = read_csv("IMDB-Movie-Data.csv")

#### 2. View the dataset

In [136]:
data.head(2)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0

In [42]:
data.tail(2)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

#### 3. Understand some basic information about the dataset and Inspect the dataframe's columns, shapes, variable types etc.

In [10]:
print(data.columns) #List the column names

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [35]:
print(data.axes) #List the raw labels and column names

[RangeIndex(start=0, stop=1000, step=1), Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')]

In [12]:
print(data.ndim) #Number of dimensions in dataframe

2

In [13]:
print(data.size) #Number of elements

12000

In [14]:
print(data.shape)#Representing the dimensionality in terms of row and column

(1000, 12)

In [37]:
print(data.values)#Repersentation of numerical data in columns

[[1 'Guardians of the Galaxy' 'Action,Adventure,Sci-Fi' ... 757074 333.13
  76.0]
 [2 'Prometheus' 'Adventure,Mystery,Sci-Fi' ... 485820 126.46 65.0]
 [3 'Split' 'Horror,Thriller' ... 157606 138.12 62.0]
 ...
 [998 'Step Up 2: The Streets' 'Drama,Music,Romance' ... 70699 58.01 50.0]
 [999 'Search Party' 'Adventure,Comedy' ... 4881 nan 22.0]
 [1000 'Nine Lives' 'Comedy,Family,Fantasy' ... 12435 19.64 11.0]]

In [63]:
data.dtypes #Represent the data types in columns

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [60]:
data.describe() #Generate basic descriptive statistics

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

#### 4. Data Selection – Indexing and Slicing data

In [68]:
data[['Votes']].head()

    Votes
0  757074
1  485820
2  157606
3   60545
4  393727

In [70]:
data[['Votes','Metascore']].head()

    Votes  Metascore
0  757074       76.0
1  485820       65.0
2  157606       62.0
3   60545       59.0
4  393727       40.0

In [79]:
data[0:2]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0

In [88]:
data.iloc[0:5,[6,7,8,9,10,11]]

   Year  Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
0  2014                121     8.1  757074              333.13       76.0
1  2012                124     7.0  485820              126.46       65.0
2  2016                117     7.3  157606              138.12       62.0
3  2016                108     7.2   60545              270.32       59.0
4  2016                123     6.2  393727              325.02       40.0

#### 5. Data Selection – Based on Conditional filtering

In [59]:
data_fil = data[data['Metascore'] > 11.0]
data_fil.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

#### 6. Groupby operations

In [89]:
data_group = data.groupby("Rank")
data_group.mean().head()

      Year  Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
Rank
1     2014                121     8.1  757074              333.13       76.0
2     2012                124     7.0  485820              126.46       65.0
3     2016                117     7.3  157606              138.12       62.0
4     2016                108     7.2   60545              270.32       59.0
5     2016                123     6.2  393727              325.02       40.0

In [55]:
data.groupby('Rating')[['Votes']].mean().head()

          Votes
Rating
1.9     77207.0
2.7     30004.0
3.2       173.0
3.5       706.0
3.7      1685.5

#### 7. Sorting operation

In [95]:
data_sort = data.iloc[0:5,[6,7,8,9,10,11]].sort_values(by="Metascore")
data_sort

   Year  Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
4  2016                123     6.2  393727              325.02       40.0
3  2016                108     7.2   60545              270.32       59.0
2  2016                117     7.3  157606              138.12       62.0
1  2012                124     7.0  485820              126.46       65.0
0  2014                121     8.1  757074              333.13       76.0

In [96]:
data_sort2 = data.iloc[0:5,[6,7,8,9,10,11]].sort_values(by="Rating")
data_sort2

   Year  Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
4  2016                123     6.2  393727              325.02       40.0
1  2012                124     7.0  485820              126.46       65.0
3  2016                108     7.2   60545              270.32       59.0
2  2016                117     7.3  157606              138.12       62.0
0  2014                121     8.1  757074              333.13       76.0

#### 8. Dealing with missing values

In [137]:
data.isnull().sum()#count how many NaN values in each column

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [130]:
data = data['Metascore'].fillna(0)

In [132]:
data.isnull().sum()

0

#### 9. Dropping columns and null values

In [142]:
data_drop = data.dropna(axis=1, how="any", thresh=None, subset=None, inplace=False)

In [143]:
data_drop.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727

In [144]:
data_drop.isnull().sum()

Rank                 0
Title                0
Genre                0
Description          0
Director             0
Actors               0
Year                 0
Runtime (Minutes)    0
Rating               0
Votes                0
dtype: int64

**Done**